{"meta":{"title":"HongLiu的小站","subtitle":"做自己所爱的事，爱自己所做的事","description":"HongLiu的赛博自建房","author":"HongLiu","url":"https://hongliu.icu","root":"/"},"pages":[{"title":"About","date":"2025-08-15T06:26:38.000Z","updated":"2025-08-21T16:28:31.499Z","comments":true,"path":"about/index.html","permalink":"https://hongliu.icu/about/index.html","excerpt":"","text":"Hello！ 做自己所爱的事，爱自己所做的事。 关于我物种：人类 等级：大三 专职：机器人工程 栖息地：西安(学)&#x2F;广东(假) 存活状态：活着 目标：活着 技术栈不是很想转码的（预备役）机器人工程师，技术栈以硬件设计&#x2F;嵌入式为主，项目经验基本是电源。打RM的；当技术研发造过超级电容，现在在干管理。梦想成为硬件大神（） 媒体技能：平面设计&amp;摄影&amp;视频制作，时不时搓点周边&#x2F;海报等小玩意。 前化学实验党&amp;化竞党&amp;晶体制作党，已淡坑。 生活栈明日方舟、文明六、百合&#x2F;轻百番、日常番、音游（半淡坑）。 联系方式你可以通过该网站导航栏（电脑端页面左侧&#x2F;手机端左上角打开）的social链接联系到我。或使用QQ邮箱&#50;&#x31;&#50;&#x30;&#54;&#57;&#48;&#x30;&#56;&#53;&#64;&#113;&#x71;&#x2e;&#99;&#111;&#109;. 网站相关建站时间：2025.08 主要内容： RM和不RM的相关想法&#x2F;杂谈 课内外相关学习笔记分享 硬件&#x2F;嵌入式日志记录 其他潜在发电记录 我们是被互联网世界伴随的一代。或许是买房焦虑从现实世界传递到互联网世界，混合想要有个地方存放一些乱七八糟文档的想法，诞生了这个赛博自建房。生活是一个时时被凝视的剧场，有的时候我们需要一些阳光照射不太到的角落来存放自己的内心。 目前的几个专栏内容： 杂谈：存储各种形成文章的想法和复盘，大多会在知乎上同步投稿。 知识笔记：因为本人的课内学习习惯是考前几天突击，并且形成了记笔记辅助记忆的习惯，所以在许多科目都基于Obsidian记了知识笔记；因此借有了网站把笔记也放上来。因为是考前突击的，所以并不会很系统很深入，可能只是一个辅助提示的作用。目前库存还有几个没搬上来。 月报：看到某位大佬的博客网站感觉给自己记月报颇有意义，但是有这个想法还没一个月所以还没付诸实施（（（敬请期待…… 技术日志：玩硬件&#x2F;嵌入式&#x2F;其他任何技术领域的记录，是的也还没有内容（）。可能会放下上赛季超电的相关文档。 其他：其他 该网站使用Hexo和Github Pages和网络知识苦手的本人搭建，你看到这条的时候或许还在优化中。 写的文档没有意外的话会在此小站首发更新。赞赏、讨论、批评我都需要。本来是想做一个评论系统方便交流的但是我前后端知识储备都为零这对我太难了研究好几天也没研究出来所以暂时搁置吧 网站部分图片等资源来源网络，侵权可联系删除。 一些也许会做的todo： 文档归档 改个优雅点的域名 内网直接访问 文档搜索功能 建站时长统计 流量监测 评论系统 做一个置顶文章更新最新动态 文档创建日期：25.08.16 最后更新日期：25.08.22"},{"title":"","date":"2025-08-18T18:13:16.535Z","updated":"2025-08-18T18:13:16.535Z","comments":true,"path":"custom.css","permalink":"https://hongliu.icu/custom.css","excerpt":"","text":":root { /* 仅修改主色调和对应的背景色 */ --color-primary: #bce672; /* 蓝绿色 */ --color-primary-bg: rgba(102, 230, 181, 0.15); /* 同步调整透明度背景 */ /* 其他变量保持默认，无需重复声明 */ }"},{"title":"文章归档","date":"2025-08-21T16:34:45.997Z","updated":"2025-08-21T16:34:45.997Z","comments":true,"path":"archive.html","permalink":"https://hongliu.icu/archive.html","excerpt":"","text":""}],"posts":[{"title":"【知识笔记】电路理论","slug":"Note-dianlu","date":"2025-08-20T12:10:22.000Z","updated":"2025-08-20T12:18:20.882Z","comments":true,"path":"2025/08/Note-dianlu/","permalink":"https://hongliu.icu/2025/08/Note-dianlu/","excerpt":"","text":"内容：电路理论 使用课本：《电路（第六版）》；ISBN 978-7-04-056553-9 学习途径：课内 由于本网站主题不支持Latex且我使用的笔记软件Obsidian，笔记在网站中图片、公式等部分显示异常，故提供md笔记的网盘链接和PDF导出文件可供下载。 ​ md笔记百度网盘链接|密码35uf ​ 电路_总笔记 md笔记建议使用Obsidian查阅，附件存放路径设置为“当前文件所在文件夹下指定的子文件夹”，子文件夹名称为assets。 下面提供部分笔记预览。 整理于：250820","categories":[{"name":"知识笔记","slug":"知识笔记","permalink":"https://hongliu.icu/categories/%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://hongliu.icu/tags/%E7%AC%94%E8%AE%B0/"},{"name":"电子","slug":"电子","permalink":"https://hongliu.icu/tags/%E7%94%B5%E5%AD%90/"}]},{"title":"【知识笔记】数字图像处理与机器视觉","slug":"Note-jiqishijue","date":"2025-08-20T10:25:34.000Z","updated":"2025-08-20T12:17:01.539Z","comments":true,"path":"2025/08/Note-jiqishijue/","permalink":"https://hongliu.icu/2025/08/Note-jiqishijue/","excerpt":"","text":"内容：数字图像处理与机器视觉 使用课本：《数字图像处理与机器视觉》；ISBN 978-7-115-34668-1 学习途径：课内 由于本网站主题不支持Latex且我使用的笔记软件Obsidian，笔记在网站中图片、公式等部分显示异常，故提供md笔记的网盘链接和PDF导出文件可供下载。 ​ md笔记百度网盘链接|密码49qi ​ 机器视觉_总笔记 md笔记建议使用Obsidian查阅，附件存放路径设置为“当前文件所在文件夹下指定的子文件夹”，子文件夹名称为assets。 下面提供部分笔记预览。 整理于：250820","categories":[{"name":"知识笔记","slug":"知识笔记","permalink":"https://hongliu.icu/categories/%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://hongliu.icu/tags/%E7%AC%94%E8%AE%B0/"},{"name":"机器人","slug":"机器人","permalink":"https://hongliu.icu/tags/%E6%9C%BA%E5%99%A8%E4%BA%BA/"}]},{"title":"【电赛】25电赛电源题（A题）-一次失败的四天三夜比赛寄录","slug":"Diansai_25","date":"2025-08-19T07:35:01.000Z","updated":"2025-08-19T11:42:06.959Z","comments":true,"path":"2025/08/Diansai_25/","permalink":"https://hongliu.icu/2025/08/Diansai_25/","excerpt":"","text":"简介本文记录了本人电赛小队队伍情况、赛前准备、赛中进程等内容；我队在本次电赛中斩获了省三等奖的搞笑成绩，但还是决定写下本记录，以供经验总结、警示后世及为未参赛的朋友们提供一点参赛信息。 背景&amp;赛前准备我队小队三人均来自我校RM硬件组队员，掌握基本的电路设计、PCB Layout、STM32嵌入式软件，除我之外两个队友都是大三（本人大二），且他们俩都会一点dsp（虽然后续没实际用上）。由于RM硬件场景基本上只有直流，我们先前项目经验也都是直流，这为我们在越来越注重交流场景的电赛中的搞笑表现埋下伏笔。 赛前我们参考了许多大佬的开源进行硬件准备，主要包括 @EDAdong 大佬的一系列采样模块和立创硬件广场上的许多功率电路开源。基本上就是微调原理图+PCB重新Layout+实物验证的工作。后续证明，实物验证确实是一个工作量大并且十分必要的工作。 元件清单发布7月23日，电赛元件清单发布，虽然对交流的东西有心理准备，但是看到清单来个三相可变电阻器，还是略微有点两眼一黑的。 在此之前我们的准备基本上还没有接触到三相，只有直流的东西和单相逆变，并且单相也只是实现了逆变，没有实现过主动整流。我们三人在电赛前都各自有事情要忙（实习&#x2F;夏令营什么的），或者说没能放足够精力在电赛备赛上吧；总之元件清单出来后我们才加急准备了两套三相全桥逆变及采样等相关板子。剩下的几天，主要做的就是理论学习，把交流这一块的各种不熟悉的控制算法都补一补，没有什么硬件上的工作。 开赛·第一天7月30日早上七点半，赛题发布。今年的A题类似18年E题单相交流电子负载的思路（非常相似），不过升级成了三相；主体上是做一个三相逆变电路（基础部分），有输出额定电压电流、波形失真度（THD）、电压调整率、调频的要求；发挥部分加一个三相整流电路，整流出来的输出回到最开始的直流母线上进行能量回馈，设置系统能量回馈后的直流电源功率（即整个系统的损耗功率）作为发挥部分关键点。分析下来本题不要求什么前沿的电路拓扑，区分度在于实现能量回馈（即整流部分和稳定直流输出）和压缩损耗功率两点。 丢个赛题下载链接在这 我们阅读了赛题确认选择该题（本来就准备的电源题所以也没什么好选的）并进行分析。首先是硬件部分，我们清单发布后准备了两套三相全桥逆变电路（包含驱动、采样等），在正式开赛前板子元件陆续到了，发题的时候已经焊接一半了；因此我们认为硬件上准备已经基本充足，对于三相线上有一些关于需要隔离的讨论，补买了三相共模电感。后续证明这部分决策基本没什么问题，重点在控制算法的实现。另外一个隐藏的难点是今年题目电压相对于往年其实偏高，额定输出线电压有效值32V，换算一下相电压峰值有26V+，因此如果不升压直接使用直流母线电压，需要至少52V电压，我们使用的是电源直出的60V电压，后续了解到其他队伍也基本是这个量级电源；开始还担心测评场地能否提供充足电源和能否使用自带仪器，后续测评那边电源只有30V，但使用自带电源是可以的。 发挥部分很快就出现两种可行思路：主动整流和被动整流+DCDC。主动整流就是直接反向使用全桥逆变的电路做APFC，同时可以做升压控制，保证输出直流可控；被动整流就是用三相整流桥和滤波输出直流，然后DCDC变换控制直流回馈。我队没有实现过主动整流，评估三相主动整流方案从头实现工作量太大，因此购买了三相整流桥，并计划使用之前准备的BuckBoost板做直流控制。 确定了大致方案后就开始准备三相逆变部分。当天下午还是晚上，我们实现了基本闭环（没矫正有点飘）的PI电压环控制的三相逆变波形，当时还是比较激动的。但其实这种比较基本常见的需求一般应当在赛前就实现出来备用，这里就体现出我们准备工作量不足了。 当天晚上差不多一二点就回去休息了。 第二天第二天继续做基础部分的剩余内容，调频和调幅。这两个比较简单，用之前验证过的主控板交互例程改一下即可。 小介绍一下我们的主控方案，使用的是NUCLEO系列的G474的主控系统板，插在一个自制的扩展板上；扩展板包括ADC&#x2F;PWM接口（XH2.54）、交互按键、OLED、LED指示灯、辅助电源接口。图片如下： 这一套用下来挺实用的，小推荐一下。 我们原本在第一天实现了PI控制的逆变之后想尝试做PR控制，但是很尴尬的事情是，我们的板子上是设置了电感电流采样和输出电流采样的，PR控制也需要这些；但是我们在前面跑PI控制的时候就出现端倪了：出现跑着跑着突然噼里啪啦响，有时候没事，有时候出现短路。仔细一查就是电感电流采样芯片坏了，多次出现而我们没有排查出原因，最终只能直接拆除电感电流采样芯片，让纯PI电压环可以正常跑。 既然控制逻辑没法优化，那么接下去就是优化了下PI控制的参数，优化了点电压调整率的东西。 做到第二天才差不多把基础部分做完，这个时候其实已经基本看到四天三夜做不完全部题目内容了；但是中途开摆不在我的选择范围内，所以开搞发挥部分。 首先是测试Boost板子及整流回馈部分使用的电流环，但是这下出问题了；由于未知原因，板子不断出现短路情况，多次烧坏驱动、MOS。该电路之前验证过并没有问题，所以这个时候出bug令我们很奇怪。当晚排查到很晚，一直修，最终比较晚的时候算是修出来一版能跑的电流环Boost；但修一晚上的稳定性还是令人堪忧。但是没办法了，到第三天了。 第三天第三天，整流桥等快递基本都到齐了，我们开搭发挥部分电路。三相逆变出来之后过三相共模电感，然后接整流桥、滤波、Boost模块和电阻。发现就算中间不上Boost模块，直接滤波后接电阻，逆变波形也出现了类似马鞍波的失真，推测是使用被动整流，电流畸变+逆变闭环控制不力导致的；从而会影响到电压值，并且直流电源数值也容易波动。但是我们先不管那么多，继续测上Boost的能量回馈。 结果当然是不尽人意，滤波整流后一上大负载就电源失控、波形变形，Boost电流环因为前级不稳定因素也没有正常跑通过，研究一整天也没有得出结果。到第三天夜里我们决定停止对于发挥部分的挣扎，通过调整LC滤波电容电感值、调整PI参数等方式，以此最后再微调一下基础部分THD、电压调整率的表现。 第四天对于发挥部分的尝试持续到第三天的后半夜（或者说第四天的凌晨半夜），简单休息一下我们就继续最后一个白天的日程，完善下上面说的基础部分东西了。此时心情是很复杂的，电赛打到第二年了而且今年是国赛，赛前的技术准备虽说还是永远不够，但在赛前已经是尽量挤时间做了（学期内还有RM备赛占据大量时间，RM25赛事结束后还承担管理任务）；到现在基础部分都做完了卡在发挥部分一点做不出来还是挺难受的。 但是客观事实不因主观思想而改变，我们最后能做的也就完善和保卫下我们已有的成果。我在第四天写了报告，队友测试的电感电容参数和辅助电源等保证每一模块都至少有两套可用。然后到了下午就是打印报告、签字、封箱了；当天晚上八点封箱完，可能今年是国赛比较严格，需要我们当晚就有一人大巴陪同作品，去到西安邮电大学存放作品了。当晚快十二点才回到学校。 辅助电源这块我想插一嘴，今年60V左右的直流输入电压，对于辅助电源的输入耐受电压其实是有挑战性的，我们赛前准备的模块并没有到这个范围，紧急买了现成的降压模块补充的。 存放作品的流程比较简单，就是老师交档案-确认队伍编号进去存放-出来回家的事情。 测评封箱送完作品就是等待测评和测评了。今年是2号完赛，4-6号进行测评。不管做的怎么样，封完箱没什么再好做的了，心里上轻松了许多；和许多队伍一样，完赛第二天我们三人都处于沉睡状态。我们安排到5号下午测评。 测评流程（具体流程看具体主办方会有差异）：在教室领号叫号-领取作品-到测评场地测评-送回作品。 具体测评过程：进去签字到测试桌前（是有多个队伍同时测试的），那边给了定时十五分钟，自己开箱接线，可以熟悉场地设备（万用表、电源等，并未提供示波器，功率分析仪可能数量原因是测评老师手里一台带着），该时间段内自己测试完成可以提前叫老师开始测评。一位老师手持测试记录表（如下图，图源为比赛之后网络流传，非本人拍摄，侵删）进行测试数据的记录，另一位老师拿功率测试仪进行数据测量。测评过程中按照老师的指示依次测量每一项数据，数据读取和记录由老师负责即可。 我们队在测评过程中没有翻车，测评效果都还行，基础部分只有电压调整率没有完全达标，基础50分自我估分应该有45+。评测完感觉还行，甚至以为有机会省二省一（）。 赛后总结根因分析首先还是分析下我们失败的原因吧；单次的成功或失败，不过是你的数据点而已 。 工作准备（技术）电赛电源题的特点是：题目可以分为DCDC、ACDC等几种大类型，对于每种大类型都需要提前准备并实现其功能（如DCDC的电压环、电流环升降压闭环控制；DCAC单相逆变；ACDC的PFC控制等），在真正比赛的时候即拿即用，才能称得上有一战之力，有精力去推进电赛的创新部分。而正如上面所说的，我们在比赛开始的时候，对于模块的实现进度太低了，就连提前准备了的Buck-Boost也在使用过程中出现bug；因此我认为赛前工作量不足是我们失败的直接原因。 在赛前准备过程中有技术路线问题，例如采用谁家开源、先准备什么模块什么的；我认为这不是重大问题，只是影响赛前需要准备的工作量多少而已，对于赛前工作准备的根本问题还是队员能抽出来多少精力和技术储备。 我队的技术经验基本都是RM训练的，我校的电赛培养、电子设计培养都约等于零；我队三人都是在RM队伍体系中参与至少一年的硬件组成员，做的东西都是车上用的直流变换以及超级电容相关的，但也是培养了基本的电路能力；不知道是电赛题目设计距离实际应用场景有gap，还是RM硬件比较偏科，总之如果不是为了备赛电赛，我们其实并不怎么接触到交流的东西。所以这是我们技术上的一个缺陷。在电赛过程中，处理逆变控制的时候，对于环路控制、PR控制等比较深的控制技术也感到比较缺乏。 团队协作（人员）决定一个时期是否成功的决定因素还是人。人员因素分为备赛人力资源和团队氛围两部分考虑。我们在团队氛围做的比较好，因为都是一起打过RM的队友，共同工作时间长，并且都比较熟悉并且都是打RM的还能熬，另外我们技术栈也都比较全，每个人单拎出来都是可以做软件也可以做硬件；因此在电赛过程中我们配合紧密，各种工作可以相互交接，也就可以合适安排休息，时间利用率还是比较高的。 但另一方面的人力资源就是我们的一个缺点。我队一人在市内实习，一人在忙夏令营，一人在忙RM的管理；导致我们在学期内基本没什么时间实际进行电赛准备，在暑假留校的一个月左右才真正大量进行备赛准备；这也就直接导致了上面的工作准备问题的缺乏。 培养氛围（环境）我校完全没有成体系的电赛培训。部分指导老师可能会提供一些相关建议，但电赛备赛完全靠自学，学校的电赛成绩也不是很好。所以我的电赛学习环境其实就只能靠RM学硬件的底子；环境因素也是构成技术缺陷的一个背后原因。 Next Time告别了2025年电赛，有遗憾也有收获。总结自己大二一年的项目经验的话，其实会发现并没有很多进步；倒是电赛这几天实践经验增长的快一些。 明年不知道会不会再打一轮电赛了，但是如果有机会打的话应该还是会参与。电赛虽然只有技术，但从技术上来说确实是个不错的锻炼机会。它涉及的技术其实并不很深入，但是需要有充足的测试和稳定性。如果再一次搞电赛的话，我希望自己和队伍能做到以下几点（算是一个checklist）： 技术 至少三个月的准备时间，这里的要求是日均备赛工作时长至少2小时 赛前能有真正能稳定运行的各种电路拓扑模块（DCDC、ACDC、DCAC、辅助电源、主控），且具有调整空间 人员 队友有合作经验（可以通过校赛、校际联赛等训练），明确自身岗位、分工（如果不软硬件兼修的话），靠谱不摸鱼跑路 环境 大环境难以改变，或许在队内或者同题型队伍之间可以有相互交流学习甚至学习小组的关系？ 北海虽赊，扶摇可接；东隅已逝，桑榆非晚。 写于 25.08.19","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"日志","slug":"日志","permalink":"https://hongliu.icu/tags/%E6%97%A5%E5%BF%97/"},{"name":"电赛","slug":"电赛","permalink":"https://hongliu.icu/tags/%E7%94%B5%E8%B5%9B/"},{"name":"硬件","slug":"硬件","permalink":"https://hongliu.icu/tags/%E7%A1%AC%E4%BB%B6/"}]},{"title":"【RM】长沙行记","slug":"RM_changsha","date":"2025-08-17T07:31:36.000Z","updated":"2025-08-19T11:38:56.022Z","comments":true,"path":"2025/08/RM_changsha/","permalink":"https://hongliu.icu/2025/08/RM_changsha/","excerpt":"","text":"从加入机器人队，从去年的太原和武汉没发挥什么实际作用的赛旅，就在想有没有那么一天，自己会不会以一个主力的身份再次来到RM这个赛场。2025，经福州和长沙二役，此时返程的火车经过武昌站，在熟悉的站台和去年的自己会面，少了些未知，却又多了更多踌躇。 长沙给我的感觉是一个各个方面都“管得比较少”的城市。对长沙的初印象并不是各式旅游景点或者网红地点，而是有些混乱的交通、有点昏暗的地铁站、夜晚人行道不足的灯光和小路上摊子脚下散发一些恶臭的油污，一个不优雅的初对面。但是在这里过了一周多，有的时候又能看到这层污渍下面，一个城市正在活着。这里有近乎夸张的夜生活，商业区彻夜的灯光映射着她的充沛精力，小吃街彻夜的店告慰了我不止一夜的心。奔波于路上不放过每一个订单机会的货车司机正在活着，红花坡蛋炒饭里招揽生意热情的老板娘也在活着。长沙告诉我的事情和北方很不一样，这里有斤斤计较的人、冷漠的人、热爱生活的人、美丽的人，他们都不是长沙的全部，但他们加在一起又是长沙的全部。这座城市以一种拟近黄老无为的态度对待她之中的人，还有我这样的来客。 考完面向对象下午马上飞机到长沙，RM中部分区赛的一周多，基本都在贺龙体育馆和租的羽毛球馆之间两点一线地度过。一群普通大学生并不能让一个历史弱队马上在春茧引吭高歌，但四十颗念着同一个名字的心确实能带来四次奋力的拼搏、一场久违的胜利。作为这个队伍几十双手的其中一双，作为一个技术点不算核心的硬件，至少我对于我的任务完成度还是比较问心无愧，超级电容上了四辆车并安稳运作不炸车，为车车们赛场上的“极限犹可突破”做了一点微小的贡献。在赛季的后半段担任了副队，说实话第一次担任这种比较管理的职务，并不自信，但是经验总归越练越有，失误问题当然不少，但能找到一点感觉，修复自己的一些死点，同时也看到了一个真实痛苦漫长伟大的机器人队伍。属于一代队员又一代队员的青春流逝，属于VGD的深圳班机仍未到来，但每一年我们都在探索，都在前进。年年岁岁花相似，岁岁年年人不同。看看明年的VGD又会是怎样的一番风貌。 打完比赛去了解放西、橘子洲、岳麓山几个经典景点。坡子街灯红酒绿，橘子洲湘江水阔，岳麓山“好的大学 没有围墙”，都是我难忘长沙记忆的一部分。 中南泻新夏，雨水洗西尘。百里一赴胜，三日宴四方。他日龙能贺，毋忘战长沙。 写于 25.05.26 从长沙回校的火车卧铺上","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"日志","slug":"日志","permalink":"https://hongliu.icu/tags/%E6%97%A5%E5%BF%97/"},{"name":"RM","slug":"RM","permalink":"https://hongliu.icu/tags/RM/"},{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/tags/%E6%9D%82%E8%B0%88/"}]},{"title":"【知识笔记】复变函数与积分变换","slug":"Note_fubian","date":"2025-08-17T06:49:18.000Z","updated":"2025-08-20T10:20:54.723Z","comments":true,"path":"2025/08/Note_fubian/","permalink":"https://hongliu.icu/2025/08/Note_fubian/","excerpt":"","text":"内容：复变函数与积分变换（复变） 使用课本：《复变函数与积分变换（第二版》；ISBN 978-7-03-044542-1 学习途径：课内 由于本网站主题不支持Latex且我使用的笔记软件Obsidian，笔记在网站中图片、公式等部分显示异常，故提供md笔记的网盘链接和PDF导出文件可供下载。 ​ md笔记百度网盘链接|密码qvyw ​ 复变_总笔记.pdf md笔记建议使用Obsidian查阅，附件存放路径设置为“当前文件所在文件夹下指定的子文件夹”，子文件夹名称为assets。 下面提供部分笔记预览。 整理于：250817","categories":[{"name":"知识笔记","slug":"知识笔记","permalink":"https://hongliu.icu/categories/%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"数学","slug":"数学","permalink":"https://hongliu.icu/tags/%E6%95%B0%E5%AD%A6/"},{"name":"笔记","slug":"笔记","permalink":"https://hongliu.icu/tags/%E7%AC%94%E8%AE%B0/"},{"name":"复变","slug":"复变","permalink":"https://hongliu.icu/tags/%E5%A4%8D%E5%8F%98/"}]},{"title":"【知识笔记】模拟电子技术基础","slug":"Note_modian","date":"2025-08-17T05:04:33.000Z","updated":"2025-08-20T10:21:06.789Z","comments":true,"path":"2025/08/Note_modian/","permalink":"https://hongliu.icu/2025/08/Note_modian/","excerpt":"","text":"内容：模拟电子技术基础（模电） 使用课本：《模拟电子技术基础》；ISBN 978-7-5606-6527-6 学习途径：课内 由于本网站主题不支持Latex且我使用的笔记软件Obsidian，笔记在网站中图片、公式等部分显示异常，故提供md笔记的网盘链接和PDF导出文件可供下载。 ​ md笔记百度网盘链接|密码yp8s ​ 模电_总笔记.pdf md笔记建议使用Obsidian查阅，附件存放路径设置为“当前文件所在文件夹下指定的子文件夹”，子文件夹名称为assets。 下面提供部分笔记预览。 整理于：250817","categories":[{"name":"知识笔记","slug":"知识笔记","permalink":"https://hongliu.icu/categories/%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://hongliu.icu/tags/%E7%AC%94%E8%AE%B0/"},{"name":"电子","slug":"电子","permalink":"https://hongliu.icu/tags/%E7%94%B5%E5%AD%90/"},{"name":"模电","slug":"模电","permalink":"https://hongliu.icu/tags/%E6%A8%A1%E7%94%B5/"}]},{"title":"【RM】队伍是学校体系夹缝中的存在","slug":"RM_team-and-school","date":"2025-08-16T03:48:59.000Z","updated":"2025-08-18T17:57:01.033Z","comments":true,"path":"2025/08/RM_team-and-school/","permalink":"https://hongliu.icu/2025/08/RM_team-and-school/","excerpt":"","text":"和朋友讨论了关于自己和学校、关于一个或者很多个机器人队队伍。 大二的第二个学期已经结束了，虽然还有电赛作为余韵盘旋在暑假里，回响着一个大二学生在学校大众宣传中应有的“激情”，虽然一个长久但是又生分的机器人队正在等待一代新的老队员的推进；两年时间足够做好和做烂很多事，事实也的确如此，而我也有很多体验想要抒发。这里是一个并不会很好组织言辞的工科男，一颗 maigo 的心。 学校评价体系和评价学校体系在这所学校待了两年，对于这个要度过四年的地方，我的总体感受是：此处符合一个 211 学校所被期望的水准，但——我用这个泛化的看似很华丽的词汇描述它，其实也是另一层不言而喻的评价——是，但也只是一个中下游 211。当然我无意像舆论&#x2F;市场那样吹捧 985 211 的什么高级性，而是想表述：这里被塑造成的，是一个被一些存在期望的样子。如果人格化一下，这个学校走在这个社会构造的评价体系下，并且努力地朝着“一个 211 该有的水平”奋斗。 好吧我这么说也有点太抽象了（特别是没对上电波的话）。 作为一个学生具体地来看，如果按照学校体系所鼓励的发展路径去发展，那么这是一个总体舒适，甚至可以说条件很不错的地方。这里所说的学校体系，指的是一个评价的舆论场，包括各种官媒校媒公众号所鼓吹的，“阳光”的，“奋斗”的一个生活方式&#x2F;学习方式，例如说“XX 青年说”“星光不负赶路人”“榜样的力量”，具体说可能是卷绩点、打某些“作品赛”，等等此类。在这种考虑情况下，这里可以称得上条件很不错，有老师有物理环境，有“比赛氛围”也有卷绩点的“学风”，一片勃勃生机，一片万物竞发。这种和谐发展当然不是学校方主观上的良心发现，而是学校面对的需求导向的必然结果。学校对于学生的第一诉求当然是稳定，第二就是创造一些成果，尤其是「显而易见」的成果。 但是从一个真正从学生出发的角度，如果一个学生尝试想去做一些拿不到很多水奖的，有时候还会给管理方带来“多余成本”的，但是意在提升自己真正能力（技术能力&#x2F;社会能力） 能够全面发展的事情&#x2F;尝试走上做这样事情的一个道路时，那么这个时候学校可就不是一个知心长辈了。这里不会有很多帮助，反而可能存在一些看似无理，实际上只是由于其保守或维护自身利益或不想增加管理成本的障碍，不给场地啦，不更新设备啦，不给资金啦，不给请假缓考啦之类的麻烦事。 这种学校诉求，或者说这种“学校评价体系”源于学校自己面临的诉求体系，或者说“评价学校体系”。“评价学校体系”谁来评？当然不是学生，是学校的甲方&#x2F;拨款人。 学校本身也不是一个整体，有校领导、学院、团队、老师，更广泛一些讲还有各路社团组织和学生；各方存在各样的利益诉求，这种学生想要真正得到全面发展的困难，并不能怪罪在某个群体上，我认为，这是“评价学校体系”发力的作用，或者说这是整个大环境长期作用的结果。这个环境即是下一部分的主题。 大自然的造化我想通过分别阐述学校内的各个群体面临的环境及其特点，来分析高校竞赛体系的存在（主要着眼于队伍外部因素）。这是个很大的命题，不可能几句话完成，不过我想先开个头。 校领导校领导层级面临的主要评价压力更多来自宏观的政策，学生竞赛对其的意义是奖项荣誉、教学成果这些比较宏观的东西，具体体现在各种学校排名（尤其招生季）；但是学生竞赛说到底对于校领导来说是没有一个直接快速的影响的，多一个少一个学生竞赛团队，或者团队多获得少获得一点资金并不会对于其有什么根本上的影响；但另一方面，竞赛团队从外部能获得的最根本、很多时候还是最大的帮助的来源又正是这个群体，例如学校层级的资金支持、活动安排等。 学院学院是各项学校活动政策直接实施到竞赛团队上的具体经手人，也是实践队伍在生活中接触的最多的一级机构。一个优秀的竞赛团队或许可以成为该学院学生实践培养的金字招牌，同时学院也会以座上宾的姿态优待竞赛团队；但现实很骨感，（就我看到的）绝大多数队伍和学院的关系是互相扶不起的关系：队伍难以做出突出的成绩，学院也作为第一赞助人，没有得到充足理由 也难以向队伍提供进一步的支持，而没有被推进支持的队伍进步的机会又更加渺茫（同等条件下），双方秉持一种尴尬的近似家长子女的关系；常见的一个队伍配置就是依托于某个学院（例如我队依托的机械学院）进行，虽然学生队伍并不至于大喊“我的原生学院”，但这种白银的处境 是很多发展困境中的队伍最直接面对的环境；作为最直接“监护人”的学院也是队伍发展过程中的一个可以说最主要的联络对象。 工训中心工训中心理论上来讲是高校学生进行技术实践的核心场所，同时是各类技术竞赛队伍的有力支撑，提供资金、场地等资源；我们也可以看到有很多 RM 队伍以及其他竞赛队伍是依托其工训中心进行的。但实际上，工训中心在课内实践培训这一块，不能说是如火如荼吧，也可以说是半死不活，基本上沦为了金工实习等走过场技术实习的配合场所；对于其竞赛队伍培育方面，不幸，我校的 RM 队伍是依托于机械学院而不是工训中心进行的，但工训中心确实为一些其他的竞赛体系提供了场所等支持。总而言之，工训中心像是一个没有固定学生的学院，其支持压力和支持意愿像是一个学院，和校领导层面挂钩，具有发展关系和寻求合作的机会，其具体潜力根据不同学校的安排会有很大不同，需要结合具体实际考虑。 指导老师指导老师由于个人的差异性，其位置在一个队伍中是一个同样差异性很大的存在。总体上来讲，指导老师关于学生队伍的关系，是学院对队伍影响力的具象化+老师个人意志的差异化。没什么意外的话指导老师一般是属于负责学院的，因此其对队伍的基本态度（或者说能做的基本措施）可以代表学院对队伍的态度，例如经费数量级、比赛场地等资源；但同时指导老师个人的能动性会使得指导老师可以选择是否将自己的力量也注入队伍中，我们可以看到，太理 RM 的萧老师、首师 RM 的张老师还有 RC 等比赛中很多指导老师，都投入很多精力在队伍中，给我们留下了很亮眼的印象。具体一些来说，指导老师承担的责任是资金流转（资金统筹、垫付、管理），活动报备（负责人、活动申报、项目申报），队伍管理，资源争取的工作；一个好的指导老师在队伍运营过程中特别是建队初期，可以起到至关重要的作用，而一个不尽人意的指导老师则可能拖慢队伍节奏，甚至严重影响备赛进度。老师和队伍的影响当然也是双向的，可能是双向奔赴也可能是螺旋下降，而这就是队伍管理层的主观发挥部分了。指导老师受到队伍成绩的影响所获得的反馈在我们所述几个外部因素中是比较大的，就是说队伍的兴衰相对来讲，对于指导老师是影响比较大的；因此这几个方面中，指导老师容易与队伍站在同一战线。 赞助公司赞助公司属于一个 DLC 部分。目前来看很少有队伍能够在资金等支持上做到完全脱离学校体系（华南理工 RC 等特例令人 orz），但在队伍依托于学校体系的大背景上，外部赞助如果做的好，也是能够作为感知很强的外部 Buff 出现的。常见的赞助领域有电机、制造、周边等。赞助方面要发挥队伍的主动作用，积极寻找赞助机会，数量是可以带来肉眼可见的成果的。我队在先前一个赛季通过积极寻求赞助，获得了很多支持。如果要说赞助公司受到的社会压力的话，基本上和社会大环境比较相关，并且波动并不明显。 总体作用让我们回到这整个“学校评价体系”以及它对于竞赛队伍、竞赛体系的影响。上述的几个方面勾勒出了一群学生若想要施展能力建立竞赛队伍，所会遇到的各色群体；说到底一个竞赛队伍正是在这样一个评价体系的夹缝下生存的，能不能发展很大程度上也要看人家的脸色。我觉得这是一个自然的过程，各类群体都是出于自己利益在变动；所以我不认为这个体系有什么好骂的，或者说骂也并不会改变这个追求能量最低点形成的体系。我并不是为这样的存在不公的体系声张，我想表达的是：叹气并不会改变什么，具体分析环境因素，从而更好发挥人的决定力量，才是建设团队的正确之道。 “前途是光明的，道路是曲折的。” 一个 RM 队伍存在的无奈所以机器人队说到底也只能在这种学校环境的夹缝里生存，并且这种环境不但极其牢固，而且随着学校的不同，面临的处境也会很不一样，这种处境也并不是单纯随着学校排名的升降而升降的。 宏观上来看，确实是学校排名、评估越高的学校，在竞赛体系培养方面提供的资源会更有优势，瘦死的骆驼比马大，一个 985 院校轻轻一挥提供的队伍资源或许就足以令一个二本队伍望其项背；但是学校在其层次里的排位、学校专业覆盖领域等也会很大影响竞赛队伍资源走向。这里要点名的是中下游九二这个群体。中下游 211&#x2F;985 是一个很尴尬的位置，本身获得了 92 这样几乎永久性的荣誉，夸张一点来讲会有“死于安乐”的习气，但另一方面中下游这个位置又弥漫着「白银」的失败感，导致学校系统总是想争取多一些荣誉让自己的名头更响。而论名声荣誉，真材实料培养工程师人才的技术竞赛的性价比简直低到发指（尤其是不名列前茅的情况）——所以处于这种境地的学校就很难给出充足的资源去给机器人比赛等这种性价比低的竞争平台。反过来讲，如果一个学校处于其大阶层的头部，哪怕这个阶层不像 C9、985 这么高，这种学校为了发掘自身对学生的优势，扩大自己的实力和名声，反倒容易支持机器人比赛这样的培养平台；我认为广工、南航都是这种类型学校的代表。 大多数竞赛队伍诚然是没有这样的好命的。绝大多数的「我们」只是不自主地来到所在的学校 所在的队伍，对着已经是烂摊子多年的烂摊子&#x2F;即将要成为烂摊子的烂摊子哀叹；自私的学校系统和自私的人，扼制着每一个向上的心。那么在这种尴尬处境下的竞赛队伍们，又都能做些什么？ 我们能做什么？我在大一入学后才了解到 RoboMaster 这个赛事，从一个对机器人技术零基础的小白接触电控、硬件知识，虽然没有成为一个出众的技术大佬，但具备了基本的工程师精神和技术素养；因此我是深深感受到了学生竞赛队伍这个模式对我的帮助。当下的技术实践教育体系是不好的，但这更凸显了学生队伍的宝贵。 作为单纯一个学生，我认为我们能做的就是在尽可能为自己发展的同时搭建&#x2F;维持&#x2F;发展一个平台，帮助更多有想法的人，同时这个过程对于自己的非技术技能也是一个最好的锻炼，这就是我留在 RM 队伍的原因。这是带有理想主义的想法，学生队伍的理念本身也带着理想主义。但是——山就在那里。 写于 25.08.16","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"RM","slug":"RM","permalink":"https://hongliu.icu/tags/RM/"},{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/tags/%E6%9D%82%E8%B0%88/"}]},{"title":"Hello World !","slug":"Hello-World","date":"2025-08-15T05:59:19.000Z","updated":"2025-08-21T16:27:39.487Z","comments":true,"path":"2025/08/Hello-World/","permalink":"https://hongliu.icu/2025/08/Hello-World/","excerpt":"","text":"★乔※迁☆新※禧★我们是被互联网世界伴随的一代，我们是生活在互联网世界中的一代。赛博买房焦虑混合想要有个地方存放一些乱七八糟文档的想法，诞生了这个赛博自建房。生活是一个时时被凝视的剧场，有的时候我们需要一些阳光照射不太到的角落来存放自己的内心。 山中何所有，岭上多白云。只可自怡悦，不堪持赠君。 更多详细信息请看关于 Hello World! 写于 25.08.16 最后更新于 25.08.17","categories":[{"name":"其他","slug":"其他","permalink":"https://hongliu.icu/categories/%E5%85%B6%E4%BB%96/"}],"tags":[{"name":"网站","slug":"网站","permalink":"https://hongliu.icu/tags/%E7%BD%91%E7%AB%99/"},{"name":"日志","slug":"日志","permalink":"https://hongliu.icu/tags/%E6%97%A5%E5%BF%97/"}]}],"categories":[{"name":"知识笔记","slug":"知识笔记","permalink":"https://hongliu.icu/categories/%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/"},{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/categories/%E6%9D%82%E8%B0%88/"},{"name":"其他","slug":"其他","permalink":"https://hongliu.icu/categories/%E5%85%B6%E4%BB%96/"}],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://hongliu.icu/tags/%E7%AC%94%E8%AE%B0/"},{"name":"电子","slug":"电子","permalink":"https://hongliu.icu/tags/%E7%94%B5%E5%AD%90/"},{"name":"机器人","slug":"机器人","permalink":"https://hongliu.icu/tags/%E6%9C%BA%E5%99%A8%E4%BA%BA/"},{"name":"日志","slug":"日志","permalink":"https://hongliu.icu/tags/%E6%97%A5%E5%BF%97/"},{"name":"电赛","slug":"电赛","permalink":"https://hongliu.icu/tags/%E7%94%B5%E8%B5%9B/"},{"name":"硬件","slug":"硬件","permalink":"https://hongliu.icu/tags/%E7%A1%AC%E4%BB%B6/"},{"name":"RM","slug":"RM","permalink":"https://hongliu.icu/tags/RM/"},{"name":"杂谈","slug":"杂谈","permalink":"https://hongliu.icu/tags/%E6%9D%82%E8%B0%88/"},{"name":"数学","slug":"数学","permalink":"https://hongliu.icu/tags/%E6%95%B0%E5%AD%A6/"},{"name":"复变","slug":"复变","permalink":"https://hongliu.icu/tags/%E5%A4%8D%E5%8F%98/"},{"name":"模电","slug":"模电","permalink":"https://hongliu.icu/tags/%E6%A8%A1%E7%94%B5/"},{"name":"网站","slug":"网站","permalink":"https://hongliu.icu/tags/%E7%BD%91%E7%AB%99/"}]}